{"podcast_details": {"podcast_title": "Accounting Today Podcast", "episode_title": "Meet the Tax Crime Junkies", "episode_image": "https://ssl-static.libsyn.com/p/assets/a/2/b/2/a2b27ad57890884ba04421dee9605cbd/podcast_1500x1500.png", "episode_transcript": " Did you know you can get Accounting Today magazine delivered to your door every month? For even more in-depth insight and analysis, call 212-803-8500 and mention this podcast to get a one-year subscription for just $149. That's 212-803-8500. Call today. Welcome to On the Air with Accounting Today. I'm Editor-in-Chief Dan Hood. Everyone associates death and taxes, but what about crime and taxes? Our guests today are a couple of tax professionals who've explored that association to create a great true crime podcast, The Tax Crime Junkies. First off, there's Dominique Molina. She's a CPA, a speaker and teacher and leader of the American Institute of Certified Tax Planners. Dom, thanks for joining us. Thanks for having me, Dan. And we also have with us her co-host, Tom Gorsinski. He's an enrolled agent, also a speaker and a teacher, and he's admitted to practice before the US tax court. Tom, thanks for joining us. Thank you for having me. For those who aren't familiar, Tom, let me throw this one at you. For those who aren't familiar with Tax Crime Junkies, what's the podcast all about? The podcast combines our two loves, which are taxes and true crime. So we look at true crime stories that have intersections to the tax world. It could be direct, as in it's a tax crime in itself, so fraud, embezzlement, things along those lines. Or it could be other crimes in general that are attached to the tax world. So it could be a murder case that's related to the IRS or someone who's practicing in the tax world or a tax firm. So any type of intersection between those two, we're interested in potentially talking about. Excellent. Well, I say in the past, we've had some people on the podcast to talk about accounting related fraud and crime. And some of those got kind of juicy, but nowhere near as juicy as the things you all dig up for tax crime junkies. These are great, great stories. And I'm sort of hoping, if you don't mind, Cher, maybe what's one of your favorite ones that you've covered? We've covered such a diversity of cases, but one of them is the Chrisley case. It's one of our first ones that we've ever done. Todd and Julie Chrisley, you may know them, they're stars on TV. They promoted their extravagant lifestyle, their wealth, their fame, but when it all came down to it, it was a house of cards built on loans and other illegal activities that ultimately led to them going to prison. And so it just demonstrates that while we see things in social media, we see things on TV, we're like, wow, these people, they're rich, they're famous, they're powerful. They could all just be smoke and mirrors. Right. So I mean, it's safe to assume that they were just wildly misrepresenting everything on their tax return. Is that the tax angle there? Were there other scams involved there? Yeah, absolutely. So in their case, they were using essentially loans and falsifying documents in order to inflate their income to get more loans to finance their lifestyle. So it was just an ongoing scheme in order to portray their wealth and prestige. Awesome. That's not awesome. It's terrible. But I love those stories. I really am. I'm a tax crime junkie. I had been previously just a fraud and embezzlement junkie. And then I realized that there was tax crime junkies out there as a podcast to listen to. So I'm now that as well. Dom, let me turn to you and ask you, what led you all to create the podcast? Well, like Tom said, he and I both are interested in true crime. I read a lot and I like to read true crime, the genre. And we've been talking about it for many years, just in terms of sharing cases and talking about the juicy details. And I said one day, you know, we should just do this as a podcast. And it kind of gives me an outlet for writing and research, which I really love to do. And Tom and I both love a good court case and diving into transcripts and court docs that are there. And so this is really a passion project, at least for me, Tom, I don't know, have I whipped you into doing this? No, not at all. I love doing it. I've always my entire life been interested in true crime. I've watched TV, watch movies, read books. And it really just helps me intersect a personal interest with a professional interest in a way that I never thought I would be able to do otherwise. Right. So I mean, obviously, right, you, like many people love the love the true crime genre. It's hugely popular these days. I mean, when you were looking at true crime stories in the past, and looking at true criminals, were you thinking, geez, I wonder what their tax return looks like? Oh, absolutely. Anything that kind of has a tax thread in it somewhere. I'll go digging for that information in the court records so that I can understand better what happened and get a chance to play Monday morning quarterback, you know, a little bit on the case and what what happened, what rulings were made. But I would say one of the earliest cases and interest I had was a local case to me. I'm in San Diego, California. And when I first started my own practice, there was a very well known local tax attorney called Doug Jennings. He went by Uncle Doug. And we did tell he's a bad guy. Exactly. Right. And we did a couple episodes on Uncle Doug and and how he turned out to really be a con artist. And unfortunately, Uncle Doug not only was ripping his clients off, but he was also giving terrible tax advice. And so in the end, you know, he was charged with tax crimes for himself, how he reported his own taxes. And I received several referrals, not from Uncle Doug, but of people that knew I was in the area, knew I specialized in tax planning, and knew there was a right way to do tax planning. And it wasn't just as simple as throw everything in a C Corp and everything's deductible. Unfortunately, that's some of the advice they received. Well, I mean, this is I think I mentioned we have a tax fraud blotter, tax crime blotter that goes out every week. And it's just it's there. None of nothing as juicy as what you all are covering. But it's astonishing how often there's just just really bad advice going on out there. And then also just plain out flat out fraud, or, you know, crime involved. So it's I mean, you I feel it's safe to say you'll have plenty of stories to come. And I want to dive a little bit more into more stories because I love them. But also a little bit how you find your stories and how you research them and how you mentioned looking at court documents and that sort of thing. So we'll dive a little bit more into that. But before we do, we've got to take a quick break. If you're interested in the topics explored in this podcast, you'll discover even more invaluable content at accountingtoday.com. Everything from the latest tax and accounting regulations to the latest innovations in technology. Explore the advances in tech page for short engaging demos that highlight new technology and platforms driving the profession forward. The world of accounting is at your fingertips at accountingtoday.com. All right. So we're going to start talking with tax crime junkies, Tom Molina and Tom Gorzinski about their podcast, which I highly recommend you take a look at it's full of these stories are fascinating. We're I've been asking them to tell some stories here today. But we're not really doing justice to the full depth of the storytelling that goes on on their podcast. So like I said, well worth a worth a look. But but while we're here while I'm talking about that, Tom, I'm actually going to hit you up. Give me another another one of your favorite tax crime stories. Well, we did multiple episodes on the Steve Martinez case. And the reason I was case resonated to me was he's a former IRS agent, a former IRS employee who used his inside information about our tax system to then con people that were working with him out of money. And so to me, that's the ultimate abuse of the public trust. You are entrusted by the IRS with inside information to help administer our tax laws and create a tax system that's fair to then leverage that information for your own personal greed. To me is just unbelievable. I mean, he went to the point of creating entities with initials that look like official government payment systems so that when those things were debited from other people's accounts, they would think that they were making a government payment when in reality it went directly into his back pocket. Trust egregious, the violations of trust are they scare me sometimes. Yeah, yeah. No, I mean, it's astonishing. I mean, that's one of the things when you look at stories like this or accounting fraud or embezzlement or any of these, you're really astonished by one the depth of I'm a little bit astonished by the depth of invention that they get to. I mean, if you could turn that innovation and creativity to some good purpose, think of what you could have accomplished, but also just the the abuse of trust that goes on and the sort of the carelessness of other people's or other institutions, reputations and futures and all that sort of stuff. It really is pretty astonishing. Yeah, you're sort of wonder how can you how do you how do you do this and live with yourself? But they're great stories. Let me ask you just to clarify, was he was he doing that while he was with the IRS or was it afterwards? He's coming out with all his knowledge from this was after he worked for the IRS, right? This is after his career was over. But if you think about it, there are a lot of former IRS employees who market their former affiliation as a sign of trust, right? Trust me to help you with your tax matters. I worked at the IRS. I know the rules. I know the system. And so in order to when you use that type of advertising or that type of knowledge as a way to draw people in, they are expecting, I think, also a level of competence and a level of ethics, to be completely honest. And that just was thrown out the window in this case. Yeah, that's good. It's crazy. It's crazy. And I'm sorry, the courts don't look kindly on that either. We are held to a higher standard. And when it comes time for penalties and punishments, I've seen plenty of court decisions that reference the position of trust that we hold in the public eye. And so the enforcement ends up being much more strict when it's against a tax professional like Steve Martinez. Right. Well, I think, as you're saying, fully appropriate, right? You want it to be that way. The problem, of course, is that he sullies the reputation not just of independent professional taxpayers, but also sort of a little bit by reflection on the IRS. The IRS needs Neil. It does not need that. So it's really a betrayal on a bunch of different levels. Wow. I could, again, talk about this for days. But I want to talk a little bit about how you find these stories and how you pick them up and then maybe a little bit about how you research them. Tom, for instance, how did you find out about Steve Martinez? Well, a lot of these cases are ones that are in the public domain. So they've happened several years ago. Some of these individuals have already been convicted. They've pled guilty, whatever happened to them. So Dominique and I will kind of bounce ideas back and forth, right? Hey, have you heard about this case? Have you heard about that case? And if it sparks an interest, we'll eventually get to some research, start looking at some documents, looking at some of the transcripts, and then start building the information to potentially do a podcast episode. Right. And, Dom, you mentioned going through court documents and all that sort of stuff. How long would it take you to say to put together an average episode? Oh, it takes a while. Initially, we're doing some basic research. The IRS is actually also a really big source of stories for us. I work with the public information officers around the country. And sometimes they're feeding me information and providing ideas for stories about cases they've seen come through their office. And so initially we start some research. It might just be some basic research just to first determine what kind of access we have to records because some records are redacted, some records aren't quite available. There's not always court transcripts available, for example, unless a party to the case has ordered those transcripts and paid for them. So we haven't gotten yet to the point where we're paying a couple thousand dollars for a court transcript yet. And I don't know that we'll have to because there's so many stories out there. We may just be able to use what's out there. But reading the transcripts, even that just is thousands of pages and lots of hours of reading. And then the writing takes quite a while as well just to organize the timeline and what took place often these IRS cases take many, many years through the investigation as well as getting through the entire court process after there's continuances and other shenanigans that happen. So it can take quite a while to piece together. Gotcha. I just I always like this is a fact that has fascinated me for years. So since you mentioned I want to throw out there because I don't think everybody knows this. But court transcripts are owned or at least in New York they are. They're owned by the court reporter. They're owned by the person who's sitting there with the little machine typing away. The copyright to them is owned. So you talk about paying a couple thousand dollars for them, at least in New York. And I know if it's the same everywhere else. You have to pay the court reporter for it. It's not the court, which I just don't know why I think that's so fascinating. But that's a weird little sideline. You're like, why am I paying them? They're just they're a public servant. But they're apparently they're not. I think they're sort of a lot of them are independent contractors. But generally, we'll see cases that go through appeal will have transcripts. So sometimes when I'm researching a case, I'm going to look for a case that has been appealed one or more times because that's generally going to give us a lot more documentation to review and look at. And it's fascinating. I have to tell you, just sorting through evidence is really is really cool. Obviously, I don't have my hands on physical evidence. You're holding the knife. The day that we find that, we're going to be in hog heaven, you know. But but even just the digital evidence that's available is just fascinating to see the checks, for example, that somebody like a Steve Martinez, he bought Super Bowl tickets with his clients stolen money. And it's just interesting to see the actual check that he wrote, knowing that at that time, he thought he was putting one over on everybody. Anyone else? Yeah, no, no, right. Well, I know. I mean, getting into the mindset of those people is fascinating. And that's I think seeing that physical stuff has got to help just to give a vibe for it. But I just want to double check. I'm assuming that with all your cases, these are all cases that have been at least decided in one court or another, even if they may still be being appealed. They have been there's been a judgment at some point, right? You can say, yes, this person was has been found guilty. Yes, absolutely. Otherwise, we might run into some slander problems if we were accusing somebody. So we're looking at cases and, you know, there's a lot of fraud happening right now with the covid aid that came out. And so I've got a little tickler file just waiting for these cases to get through the court process so we can cover them on tax crime junkies. Awesome. Awesome. All right. I think I've gotten two stories from Tom. I don't want to get another story before before we go. So Tom, do you have another another favorite story of yours? Yes. I think one of the cases that I maybe took a little overboard, I don't know, I'll let the listeners decide on that. We covered a case that we called from garbage man to jailbird, and it was really the story of this very smart, talented businessman out of Hawaii called Wagdee. And Wagdee was able to negotiate the entire island of Guam's garbage handling with his company. It was an interesting career, an interesting business to research a little bit. I didn't know much about garbage processing before we took on that case. But somewhere he went awry and started doing some fraudulent things in terms of his tax returns and financial statement reporting as well. And unfortunately, at the end of the day, a lot of time had passed. Wagdee was getting up there in age and he ended up passing away. And you'll have to listen to the episode to find out what happens in between. But I actually watched his funeral on YouTube. It's posted out there and I was just doing general research and I came across and I thought, no, there's no way this is the same person. And in fact, it was. And so I watched it really late at night. And Tom, I sent you a text message practically in the middle of the night saying, I think I need help. But these stories are so fascinating and each one of them is so rich with sort of individual detail to them that just makes them, they're really great. I highly recommend everybody should go check them out. And each one is different. I mean, as I said, we do a tax fraud blotter every week, but there is a lot of the same story over and over again for those because they're sort of basic tax crimes. But the ones you guys are covering are so deep and interesting and varied. They're a lot of fun, but also kind of instructive. Maybe Dom, tell us a little bit, what's the reaction been like? How are people getting you help, as you say? Or are they enjoying it? Or have you had any clients react or anything like that? Yeah, actually, Tom and I have been recognized in public, which is a little startling because you never really know who's paying attention to what you're doing. And like I said, it's a passion project. So we put them out, but I'm not trying to gain any business from it or anything like that. So it's interesting when we meet a fan out in public that says, hey, I heard your show or I heard about your show. And that's kind of fun. And of course, we have family members that are very, very loyal listeners. So my sister will text me about once a week and go, OMG, the case you covered this week was so good. And she's not a tax person at all. Awesome. I assume all your relatives and friends now have straightened out their taxes and made sure that they never appear on the podcast. I would hope so. It's funny because I go to a lot of tax events with other professionals and I'll just be walking down the hall and they'll come up to me like, I love the podcast. That's the first thing they will say. And now I've even gotten to the point where there are non-tax people who are like friends of friends and I'll go somewhere and they say, oh wait, you do that podcast, don't you? And I'm like, how did you hear about it? And so as with anything, as we put more out there, it's just spreading even beyond the tax community where how many degrees of separation from me now does somebody listening to the podcast on a regular basis. It's just fascinating. People who I never would have assumed are like, oh yeah, I have that on my list. I've been listening to it. Well, let's say it's full of, I mean, it's obviously it's full of tax detail, but there's no reason you need to be a tax expert. I'm sure you don't. But you don't even need to be that interested in taxes to be interested in these stories because they're so rich and juicy and criminal. Let me just before we go, where can people find it? What's the best place for people to find it? Is there a URL? Is it available on iTunes, that sort of thing? Yeah, you can find it anywhere you get your favorite podcast. We're on Apple iTunes, we're on the Google Play Store, we're on Spotify, we're on Amazon Music. So just about anywhere you get your podcasts, you can find our podcast available for download and you can set it to where you're getting all the new episodes and getting alerts every single week so you don't miss a single one. Excellent. Again, it's tax crime junkies and you want to set that alert because it's pretty addictive. Dom Malina and Tom Gorzinski, thank you so much for joining us today. Thank you for having us. It's a pleasure. Thank you. Cheers and thank you all for listening. This episode of On the Air was produced by Accounting Today with audio production by Kevin Parisi. Rate or review us on your favorite podcast platform and see the rest of our content on accountingtoday.com. Thanks again to our guests and thank you for listening."}, "podcast_summary": "In this podcast episode, the host interviews Dominique Molina and Tom Gorsinski, the hosts of the \"Tax Crime Junkies\" podcast. They discuss their love for true crime and taxes, and how they decided to create a podcast that combines these two interests. They also share some of their favorite tax crime stories, including cases involving fraud, embezzlement, and tax scams. The hosts explain how they find and research these stories, which often involve reading court documents and transcripts. They also discuss the reaction they have received from listeners and their experiences being recognized in public. The podcast is available on various platforms, including iTunes, Google Play Store, Spotify, and Amazon Music.", "podcast_guest": "Dominique Molina", "podcast_highlights": ""}